{
  "id": "assoc_business_fundamentals",
  "credentialType": "Associate Certificate",
  "title": "Associate Certificate: Business Fundamentals",
  "overviewAndProgramRelevance": "This entry-level credential provides foundational business knowledge in accounting, marketing, information systems, and general business operations. It equips learners with transferable skills that align with British Columbia’s employment demand in business support, finance, and administrative occupations, particularly across northern and central regions served by CNC.",
  "courses": {
    "required": [
      {
        "code": "COM 105",
        "title": "Financial Accounting",
        "notes": null
      },
      {
        "code": "COM 130",
        "title": "Principles of Marketing",
        "notes": null
      }
    ],
    "choiceGroups": [
      {
        "label": "One of the following",
        "choices": [
          {
            "code": "COM 105",
            "title": "Computer Information Systems",
            "notes": null
          },
          {
            "code": "COM 100",
            "title": "Fundamentals of Business",
            "notes": null
          }
        ]
      }
    ]
  },
  "employmentPathwaysAndLabourMarketData": {
    "summary": "Graduates can transition into multiple entry-level occupations within small businesses, local government, non-profits, and Indigenous enterprises. The table outlines verified job connections, NOC 2021 codes, provincial and regional outlook, and supporting data sources.",
    "occupations": [
      {
        "title": "Administrative Assistant / Office Administrative Assistant",
        "relevantSkillsFromCertificate": "Business fundamentals, document management, and software literacy (COM 105 or COM 100).",
        "noc2021Code": "13110",
        "projectedOpenings": {
          "approximateNumber": 13410,
          "region": "British Columbia",
          "period": "2024-2034",
          "source": "WorkBC"
        },
        "wageInfo": {
          "medianHourlyWage": 26.37,
          "region": "Cariboo",
          "currency": "CAD",
          "source": "Job Bank Wage Report"
        },
        "extraNotes": null
      },
      {
        "title": "Accounting / Bookkeeping Clerk",
        "relevantSkillsFromCertificate": "Financial reporting, data entry, and accounting cycle (COM 105).",
        "noc2021Code": "14200",
        "projectedOpenings": {
          "approximateNumber": 10570,
          "region": "British Columbia",
          "period": "2024-2034",
          "source": "WorkBC"
        },
        "wageInfo": {
          "medianHourlyWage": 28.0,
          "region": "Cariboo",
          "currency": "CAD",
          "source": "Job Bank"
        },
        "extraNotes": null
      },
      {
        "title": "Marketing / Sales Support / Digital Marketing Assistant",
        "relevantSkillsFromCertificate": "Marketing principles, consumer behaviour, and communication (COM 130).",
        "noc2021Code": "11202",
        "projectedOpenings": {
          "approximateNumber": null,
          "region": "British Columbia",
          "period": null,
          "source": "Indeed.ca sample"
        },
        "wageInfo": null,
        "extraNotes": "Indeed.ca lists over 200 active postings for marketing assistant and coordinator roles in BC (January 2025 sample)."
      }
    ]
  },
  "regionalInterpretationNorthernBC": {
    "regionsCovered": ["Cariboo", "Nechako", "Prince George"],
    "highlights": [
      "Administrative roles show stable regional employment and verified good outlooks in the Cariboo region.",
      "Accounting and bookkeeping roles remain steady but competitive in the Cariboo and Nechako labour markets, with limited public listings but ongoing replacement demand.",
      "Marketing-related roles are emerging and less regionally concentrated, with opportunities increasingly available through remote or hybrid work arrangements."
    ],
    "regionalContext": {
      "employmentApprox": 76500,
      "unemploymentRatePercent": 7.2,
      "primarySectors": [
        "healthcare",
        "education",
        "trade",
        "forestry",
        "construction"
      ],
      "notes": "These sectors rely on administrative, accounting, and business-support functions that align directly with this certificate’s learning outcomes."
    }
  },
  "upskillingAndPLARPathways": {
    "summary": "This associate certificate supports learners who are returning to education, reskilling after career interruptions, or seeking advancement in current employment.",
    "careerApplications": [
      "Career changers from trades, retail, or community services can formalize business and accounting skills.",
      "Small business owners can strengthen financial and marketing competencies to manage operations effectively."
    ],
    "plarEvaluationChecklist": [
      "Minimum of two years verified business or administrative experience aligned with course outcomes.",
      "Employer letters verifying bookkeeping, marketing, or office coordination duties.",
      "Work samples such as spreadsheets, marketing plans, or financial statements.",
      "Recognized training or certifications such as MS Office Specialist or bookkeeping certificates.",
      "Challenge exam or interview to verify learning outcomes.",
      "Prior learning must be current (within ten years), sufficient, and verifiable."
    ]
  },
  "summaryInsightEvidenceBased": {
    "provincialDemand": "More than 24,000 forecast openings (2024-2034) across administrative (13,410) and accounting (10,570) occupations in BC.",
    "regionalStability": "Verified Good outlook for administrative assistants and Moderate for accounting clerks in the Cariboo region.",
    "earningPotential": "Median wages between 26 and 28 CAD per hour for administrative and accounting support roles in the Cariboo region.",
    "marketingPathway": "Positive provincial outlook but limited regional data; best framed as flexible or remote work potential."
  },
  "conclusion": "The Associate Certificate: Business Fundamentals is a data-supported and regionally aligned credential for CNC’s northern BC catchment area. Verified labour market evidence confirms strong and moderate outlooks for administrative and accounting occupations, with consistent wage growth and replacement demand. Marketing and digital roles remain viable through provincial and remote opportunities. This credential serves as an accessible on-ramp to employment, professional advancement, or continued study within CNC’s BAP framework."
}
