[
  {
    "programId": "assoc-auditing-data-analytics",
    "whoThisIsFor": [
      "People working in bookkeeping, payroll, accounts payable or receivable, or other accounting support roles.",
      "Staff who help with audit engagements or compliance reviews but do not have formal audit or data analytics training.",
      "Employees seeking advancement by building stronger skills in accounting systems, automation, and data enabled decision making.",
      "Adults returning to education after experience in finance, operations, or office administration.",
      "Learners who want a focused, stackable credential that can be applied toward CNC Business Administration pathways."
    ],
    "careerApplications": [
      "Support financial auditors and accountants with audit preparation, testing, and documentation in public practice firms.",
      "Maintain computerized accounting systems, reconciliations, and reporting in corporate, government, and non profit organizations.",
      "Use data analytics tools to analyze financial information, detect anomalies, and support management decision making."
    ],
    "summaryInsights": [
      "Labour market forecasts show strong combined demand for financial auditors, accountants, accounting technicians, and clerks in British Columbia through 2034.",
      "Regional median wages for accounting and auditing occupations in northern BC are competitive, supporting solid earning potential for graduates.",
      "Data literacy and analytics skills are increasingly required in finance and audit roles, opening up hybrid data and accounting opportunities.",
      "The three course structure provides a targeted, time efficient way to align existing experience with current expectations for technology enabled financial analysis."
    ],
    "plarChecklist": [
      "At least two years of experience in accounting, bookkeeping, audit support, or financial systems work related to program outcomes.",
      "Employer letters confirming duties such as reconciliations, ledger maintenance, use of accounting or audit software, and support for audit or compliance work.",
      "Work samples like reconciliations, ledgers, working papers, system generated reports, or other anonymized financial documents that demonstrate applied skills.",
      "Evidence of informal or non credit learning, for example Excel workshops, accounting software training, or internal policy and procedure courses.",
      "A challenge exam, interview, or portfolio review that demonstrates understanding of computerized accounting, auditing foundations, and data analytics concepts.",
      "All prior learning must be current, relevant to the certificate, and verifiable."
    ]
  },
  {
    "programId": "assoc-business-analysis-project-management",
    "whoThisIsFor": [
      "Administrative or coordinator staff who want to move into business analysis, project coordination, or systems support roles.",
      "People already supporting IT or operational projects without formal project management training.",
      "Learners seeking entry into organizational improvement, systems implementation, or operational analyst positions.",
      "Adults re entering education after working in HR, operations, office management, or related roles.",
      "Students building stackable credentials that ladder toward the CNC Business Administration diploma."
    ],
    "careerApplications": [
      "Coordinate small to medium projects, track timelines and budgets, and support project documentation.",
      "Act as a bridge between business users and technical teams when adopting new systems or digital tools.",
      "Support continuous improvement initiatives by mapping processes, analyzing requirements, and helping implement changes."
    ],
    "summaryInsights": [
      "Project management and business analysis roles are growing as organizations rely more on structured projects and digital transformation.",
      "Administrative and project coordination occupations show thousands of projected openings in BC, providing stable career options.",
      "Database and systems related roles are expanding as organizations adopt new digital tools, enterprise systems, and data platforms.",
      "Northern BC employers in resource industries, health, education, and government need staff who can coordinate projects, support systems, and improve business processes."
    ],
    "plarChecklist": [
      "Around two years of experience in project coordination, business or systems analysis, operations support, HR coordination, or similar administrative roles.",
      "Employer letters confirming involvement in project tasks, use of information systems, documentation, analysis, or HR processes connected to projects.",
      "Work samples such as project schedules, meeting minutes, workflow diagrams, system screenshots, reports, or HR planning artifacts, appropriately anonymized.",
      "Evidence of non credit learning such as short courses in project management, systems administration, data tools, or HR practices.",
      "A challenge interview or assessment showing competency in management information systems, project management fundamentals, and HR concepts.",
      "Prior learning must be current, relevant to the certificate, and verifiable."
    ]
  },
  {
    "programId": "assoc-business-essentials",
    "whoThisIsFor": [
      "People advancing in administrative roles who want a short credential that strengthens business foundations.",
      "Adults returning to education after time in the workforce who want to refresh business, finance, or HR skills.",
      "Learners seeking recognition for prior experience in office, HR, or finance settings.",
      "Individuals exploring entrepreneurship or planning to use foundational business skills to support small business activity."
    ],
    "careerApplications": [
      "Move from general office support into more responsible administrative or coordinator roles.",
      "Use finance and HR fundamentals to support small organizations that need staff who can handle multiple functions.",
      "Leverage business foundations to explore entry roles in financial services or HR support, depending on elective choices."
    ],
    "summaryInsights": [
      "More than twenty five thousand projected openings across administrative, HR, and financial roles in BC between 2024 and 2034 support strong demand.",
      "The Cariboo region shows a good outlook for administrative officers and HR officers, indicating stable local opportunities.",
      "Median earnings typically range from about twenty six to thirty five dollars per hour, depending on specialization and regional employer.",
      "Entrepreneurship and small business activity remain strong in northern communities, supporting pathways into self employment and small enterprise support roles."
    ],
    "plarChecklist": [
      "At least two years of verified business, HR, finance, or entrepreneurial experience aligned with program learning outcomes.",
      "Employer letters confirming supervisory, HR coordination, bookkeeping, or closely related responsibilities.",
      "Work samples such as business plans, financial statements, policy documents, or other artifacts that demonstrate applied business skills.",
      "Recognized non credit training such as payroll courses, HR certificates, or financial services accreditations.",
      "A challenge exam or interview to confirm that prior learning meets certificate level outcomes.",
      "Prior learning must be recent enough to remain valid, sufficient in scope, and verifiable."
    ]
  },
  {
    "programId": "assoc-business-fundamentals",
    "whoThisIsFor": [
      "New entrants to business studies who want an accessible, entry level credential.",
      "Career changers from trades, retail, hospitality, or community services who want to build business and accounting foundations.",
      "Small business owners or managers who want to strengthen financial and marketing competencies.",
      "Learners who plan to continue into the Business Administration certificate or diploma and want to begin with a focused three course package."
    ],
    "careerApplications": [
      "Formalize business skills for people moving from hands on or front line roles into office and coordination positions.",
      "Support small business operations by understanding financial statements, basic accounting, and marketing essentials.",
      "Provide a stepping stone toward further study in accounting, marketing, or general business administration."
    ],
    "summaryInsights": [
      "Provincial forecasts show more than twenty four thousand openings across administrative and accounting support roles in BC through 2034.",
      "Outlooks indicate good demand for administrative assistants and moderate demand for accounting clerks in the Cariboo region.",
      "Median wages for administrative and accounting support roles in northern BC are generally in the mid twenties per hour, with variation by employer and experience.",
      "Marketing and communications roles have positive provincial outlooks; for northern learners, these can often be accessed through flexible or remote work options."
    ],
    "plarChecklist": [
      "Around two years of business or administrative experience that matches course level outcomes.",
      "Employer letters describing bookkeeping, marketing, or office coordination duties.",
      "Work samples such as spreadsheets, simple budgets, marketing plans, or financial statements that demonstrate applied skills.",
      "Recognized non credit learning or certifications, for example MS Office Specialist or bookkeeping courses.",
      "A challenge exam or interview to verify that prior learning covers key business fundamentals.",
      "Prior learning must be current, substantial enough to cover outcomes, and verifiable."
    ]
  },
  {
    "programId": "assoc-hospitality-guest-experience-management",
    "whoThisIsFor": [
      "People seeking entry into hotel, restaurant, tourism, or other guest focused service roles.",
      "Frontline hospitality staff who want to formalize skills and move into supervisory or assistant manager positions.",
      "Small hospitality operators who want to improve service standards, cost control, and operational efficiency.",
      "Workers reskilling after career interruptions who need applied training tied to verified regional hiring demand in accommodation and food services."
    ],
    "careerApplications": [
      "Transition from retail or general customer service into hotel front desk, guest services, or food and beverage roles.",
      "Progress from frontline roles into shift supervisor or assistant manager positions in accommodation or food service operations.",
      "Improve the performance of small hospitality businesses by applying management, cost control, and guest experience practices."
    ],
    "summaryInsights": [
      "The accommodation and food services sector continues to show steady hiring for managers, supervisors, and guest service staff across BC.",
      "Regional outlooks for accommodation and food services suggest stable demand driven by travel, industry activity, and community events.",
      "Typical wages for hospitality roles range from entry level rates up to the low or mid thirties per hour for supervisory and management roles, depending on employer and location.",
      "Structured learning pathways from entry level guest service to supervisory and management roles make this certificate a practical first credential for career progression."
    ],
    "plarChecklist": [
      "At least two years of experience in hospitality, food service, hotels, tourism, or related guest facing roles.",
      "Employer letters confirming responsibilities such as shift supervision, guest service, cash handling, or operational support.",
      "Work samples like service logs, schedules, simple event or promotion plans, or inventory and cost tracking records, with any personal data removed.",
      "Recognized sector training such as Foodsafe, Serving It Right, emerit modules, or internal company training on service or operations.",
      "A challenge activity or interview to confirm competence in service standards, safety practices, and basic operational procedures.",
      "All prior learning evidence must be current, relevant to hospitality operations, and verifiable."
    ]
  },
  {
    "programId": "assoc-recruitment-specialist",
    "whoThisIsFor": [
      "People working in HR, recruitment, or staffing who want formal training in workforce planning, compensation, and hiring.",
      "Administrative staff who help with posting jobs, screening candidates, or onboarding and want to deepen their HR skills.",
      "Supervisors and managers who are responsible for hiring and want better tools for fair and effective selection.",
      "Adults returning to education who have related HR or office experience and want a focused recruitment oriented credential."
    ],
    "careerApplications": [
      "Work as a recruitment or staffing coordinator supporting end to end hiring processes.",
      "Support HR teams with workforce planning, job design, and compensation administration.",
      "Help managers in small and medium organizations design and run fair, transparent recruitment processes."
    ],
    "summaryInsights": [
      "Human resources and recruitment roles remain in stable demand, with BC forecasts showing ongoing openings for HR officers, assistants, coordinators, and staffing clerks.",
      "Wage levels for HR and recruitment roles in BC and northern communities support long term, sustainable careers.",
      "Organizational turnover and talent shortages in many sectors drive continued need for trained recruitment specialists.",
      "The three course structure offers a concentrated learning experience in HR planning, recruitment, and compensation, which are core elements of modern HR practice."
    ],
    "plarChecklist": [
      "At least two years of experience in HR, recruitment, staffing, or closely related administrative work.",
      "Employer verification of duties such as posting jobs, screening applicants, coordinating interviews, onboarding hires, or supporting compensation changes.",
      "Work samples such as job postings, interview guides, screening tools, workforce plans, or compensation summaries, anonymized where appropriate.",
      "Relevant informal or non credit training such as HR courses, recruitment certificates, or interviewing workshops.",
      "A challenge interview or assessment that confirms knowledge of recruitment, compensation, and strategic HR planning concepts.",
      "Evidence must be current, reliable, and clearly connected to the outcomes of the certificate."
    ]
  },
  {
    "programId": "assoc-small-business",
    "whoThisIsFor": [
      "People preparing to launch or support a small business in retail, services, trades, or community based sectors.",
      "Workers moving from front line or service roles into broader administrative or operations positions in small organizations.",
      "Individuals involved in family owned or community run enterprises who want stronger management and planning skills.",
      "Learners seeking entrepreneurial training to complement existing work experience.",
      "Students interested in gaining HR, project coordination, or basic legal knowledge through their choice of elective."
    ],
    "careerApplications": [
      "Plan, launch, and manage small businesses with a better understanding of people, finance, and operations.",
      "Support owners or managers in family or community enterprises by taking on coordination, HR, or project tasks.",
      "Use entrepreneurship, HR, project management, or business law skills to strengthen day to day small business operations."
    ],
    "summaryInsights": [
      "Administrative officer and administrative assistant roles show stable demand to 2034, confirming their importance in supporting small businesses.",
      "Regional wage data suggests mid range hourly earnings for many small business support roles in northern BC.",
      "Entrepreneurship continues to expand as communities diversify local economies and plan for succession of existing enterprises.",
      "Elective options in HR, project management, or business law let learners tailor the certificate to common operational needs in small business environments."
    ],
    "plarChecklist": [
      "About two years of experience in small business, retail management, administrative coordination, entrepreneurship, or related operational roles.",
      "Employer verification of responsibilities such as scheduling, customer service, basic HR tasks, or operations support.",
      "Work samples including business plans, marketing materials, financial summaries, schedules, or communication artifacts, anonymized where required.",
      "Proof of relevant non credit learning such as entrepreneurship workshops, project management microtraining, or workplace leadership programs.",
      "A challenge interview or assessment that demonstrates competence in organizational behaviour, entrepreneurship, and the chosen elective area.",
      "All evidence must be current, relevant to small business operations, and verifiable."
    ]
  },
  {
    "programId": "cert-business-administration",
    "whoThisIsFor": [
      "Adults returning to education after time in the workforce who want a comprehensive business foundation.",
      "People seeking advancement from entry level administrative or customer service roles into higher responsibility positions.",
      "Learners transitioning from retail, trades, or community services into business oriented functions.",
      "Students pursuing a recognized credential to improve employability or access further business studies."
    ],
    "careerApplications": [
      "Build pathways from administrative roles into coordinator or specialist positions in HR, finance, or operations.",
      "Transition into accounting support, client services, marketing coordination, or data administration roles.",
      "Strengthen business fundamentals to support entrepreneurial ventures or small business management."
    ],
    "summaryInsights": [
      "Provincial forecasts indicate more than thirty three thousand combined openings in administrative and accounting support roles in BC through 2034.",
      "Administrative and financial support occupations show stable regional outlooks, with steady wage growth and ongoing replacement demand.",
      "Median wages for administrative and financial support roles in northern BC generally range from the mid twenties to mid thirties per hour, with higher earnings in some organizations.",
      "The certificate delivers a versatile business skill set that applies across private, public, non profit, and Indigenous organizations in northern BC."
    ],
    "plarChecklist": [
      "At least two years of verified experience in administrative, customer service, business support, or financial roles.",
      "Employer letters confirming responsibilities such as bookkeeping, reporting, client communication, or coordination tasks.",
      "Work samples including spreadsheets, reports, operational documents, marketing assets, or financial statements that show applied business capability.",
      "Recognized non credit training or certifications such as MS Office, customer service, bookkeeping, or relevant industry courses.",
      "A challenge exam or interview to demonstrate applied understanding of business foundations.",
      "Prior learning must be current, clearly related to the certificate outcomes, and verifiable."
    ]
  }
]
